lfazio/rv32cortex-m/src/platform/stm32f446/main.c
/* SPDX-License-Identifier: Apache-2.0 */
/*
 * main.c - Emulator firmware for the Nucleo-F446RE.
 *
 * Bring-up is done entirely with ST's own driver pack: the CMSIS device
 * headers for register definitions, ST's startup file and
 * system_stm32f4xx.c, and the STM32Cube HAL for the clock tree, GPIO and
 * USART. Nothing here reimplements a peripheral the vendor already
 * supports.
 *
 * What this file adds is the glue: a guest address space built out of ARM
 * memory and ARM peripherals, and a run loop that hands control back often
 * enough for the ARM side to keep servicing its own interrupts.
 *
 * Which guest ISA runs on it is not this file's business. It opens a core
 * through emu_cpu_ops_t and drives that; the interrupt controller, the
 * timer and the state dump all come from the frontend. The only part below
 * that names an architecture is the JIT statistics block, and that is
 * because the Thumb-2 JIT is one particular frontend's backend.
 */

#include "stm32f4xx_hal.h"
#include "board.h"
#include "emu_board.h"
#include "emu_run.h"
#include "emu_console.h"

#if EMU_NET
#  include "emu_net.h"
#endif

#include "emu/emu_cpu.h"
#include "emu/emu_dev.h"
#include "emu/emu_memmap.h"

#if EMU_GUEST_ARCH_RV32
#  include "rv32/rv_backend.h"  /* which backend came up */
#  include "rv32/rv_jit.h"      /* JIT statistics, reported below */
#endif

#include <string.h>

/* The guest binary, embedded by guest_image.S. */
extern const uint8_t emu_guest_image[];
extern const uint32_t emu_guest_image_size;
extern const uint32_t emu_guest_ro_size;

/* ------------------------------------------------------------------ */
/* Configuration                                                       */
/* ------------------------------------------------------------------ */

/*
 * Guest RAM is not a fixed-size array: the link script places it between
 * the firmware's .bss and the stack and gives it everything in between, so
 * the guest automatically receives all the SRAM the ARM side is not using
 * (see .guest_ram in stm32f446retx.ld).
 */
extern uint8_t __guest_ram_start[];
extern uint8_t __guest_ram_end[];

#define GUEST_RAM_BASE_PTR  (__guest_ram_start)
#define GUEST_RAM_SIZE      ((uint32_t)(__guest_ram_end - __guest_ram_start))

/* Guest time runs at 1 MHz, derived from the DWT cycle counter. */
#define EMU_TIMER_HZ        1000000u

/* Instructions executed between returns to the ARM side. */
/*
 * A cap on how long a guest may run before the firmware gives up.
 *
 * The host runner has --max-insn and two of the Berkeley tests depend on
 * it to terminate at all -- they are *meant* to run away, and the cap is
 * what turns that into a reported failure. The board had no equivalent,
 * so the same guest hangs it: no output, no prompt, and the only way out
 * is a reset, which is indistinguishable from a firmware crash. That is
 * the difference between a suite that reports 273 passed and 1 failed
 * and one that stops after test 47 and needs a human.
 *
 * Zero disables it, which is what an interactive session or a benchmark
 * wants. The default is generous: CoreMark retires about 1.3 million
 * instructions a run and the architecture tests far fewer, so anything
 * reaching this is not making progress.
 */
#ifndef EMU_MAX_INSN
#define EMU_MAX_INSN         100000000u
#endif

#ifndef EMU_RUN_SLICE
#define EMU_RUN_SLICE        4096u
#endif

/* ------------------------------------------------------------------ */
/* State                                                               */
/* ------------------------------------------------------------------ */

static emu_bus_t  g_bus;
static emu_core_t g_core;
static emu_uart_t g_uart;

/* ------------------------------------------------------------------ */
/* Console                                                             */
/* ------------------------------------------------------------------ */

/* Nothing this early can be reported; halt so a debugger sees where. */
static void fatal_halt(void)
{
    __disable_irq();
    for (;;) {
    }
}

void emu_console_putc(uint8_t c)
{
#if EMU_NET
    /*
     * One console, two sinks. Before emu_net_init() succeeds the byte
     * goes to the UART; after it, the UART carries IP and the console is
     * a ring a telnet client drains. The handover is one-way.
     */
    if (emu_net_active()) {
        emu_net_console_putc(c);
        return;
    }
#endif
    board_console_putc(c);
}

#if EMU_NET
/*
 * Uploads are declined on this board.
 *
 * The stack's TFTP server needs somewhere to put an image, and on the
 * F746 that is a flash arena in sectors 5-7 with an erase-and-retry
 * recovery. This part has flash and no arena carved out of it, so the
 * honest answer is a refusal the client can see -- an "access violation"
 * at the far end -- rather than a partial write into whatever follows
 * the firmware.
 *
 * Everything else the stack offers works: ping, the telnet console, and
 * the gdb stub. Implementing the arena here is a self-contained addition
 * and the reason these are functions rather than an #if.
 */
bool emu_net_image_begin(emu_net_image_t which)
{
    (void)which;
    return false;
}

bool emu_net_image_data(emu_net_image_t which, const void *data,
                        uint32_t len, uint32_t off)
{
    (void)which; (void)data; (void)len; (void)off;
    return false;
}

void emu_net_image_end(emu_net_image_t which, uint32_t len, bool ok)
{
    (void)which; (void)len; (void)ok;
}
#endif

#define console_putc   emu_console_putc
#define console_puts   emu_console_puts
#define console_printf emu_console_printf
#define console_putu   emu_console_putu
#define console_puthex emu_console_puthex




/* Transport hooks for the guest's virtual UART. */

static int guest_uart_rx(void *ctx)
{
    (void)ctx;
    return board_console_getc();
}

/* ------------------------------------------------------------------ */
/* ECALL services                                                      */
/* ------------------------------------------------------------------ */

