lfazio/rv32cortex-m/src/platform/stm32f446/main.c
/* ------------------------------------------------------------------ */
/* What this board owes the shared runner (see emu_board.h)            */
/* ------------------------------------------------------------------ */

/*
 * Guest time, from the cycle counter. The divisor is fixed at start-up
 * because SystemCoreClock is, and the epoch is the first slice rather
 * than reset so a guest's clock starts near zero.
 */
static uint32_t g_cycles_per_tick;
static uint32_t g_start_cycles;

uint64_t emu_board_time_now(void)
{
    return (uint64_t)(board_cycles() - g_start_cycles) / g_cycles_per_tick;
}

const char *const emu_board_core_name = "Cortex-M4";

/*
 * Fixed: this part takes no uploads, so the image is the linked-in one
 * and these never move. A board that can be reloaded assigns them.
 */
const uint8_t *emu_board_img      = emu_guest_image;
uint32_t       emu_board_img_size = 0u;   /* set in main, see below */
uint32_t       emu_board_img_ro   = 0u;

uint8_t *emu_board_ram      = NULL;   /* both set in main, see below */
uint32_t emu_board_ram_size = 0u;

/*
 * The passthrough windows. Identity-mapped, so a guest driver writing
 * what its datasheet says reaches the real peripheral -- which is the
 * point of this emulator and the reason this table cannot be shared:
 * the windows differ per part, and so does which of them a guest may
 * write.
 */
bool emu_board_add_regions(emu_bus_t *bus)
{
    for (unsigned i = 0; i < sizeof(g_periph_map) / sizeof(g_periph_map[0]);
         i++) {
        if (!emu_bus_add_passthru(bus, g_periph_map[i].name,
                                  g_periph_map[i].base,
                                  g_periph_map[i].size,
                                  (uintptr_t)g_periph_map[i].base,
                                  g_periph_map[i].perm, EMU_WANY)) {
            return false;
        }
    }
    return true;
}

/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */



/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M4
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_puts("\n\nrv32cortex-m: NATIVE CoreMark on Cortex-M4 @ ");
        console_putu(SystemCoreClock / 1000000u);
        console_puts(" MHz\n\n");
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_puts("\n-- native --\n  host     ");
        console_putu(board_cycles() - c0);
        console_puts(" cycles\n");
        for (;;) { __WFI(); }
    }
#endif
    /*
     * The frontend names itself, and builds its ISA string from the
     * extensions actually compiled in, so the banner cannot drift from what
     * the core implements -- which it could when this file spelled the
     * string out itself.
     */
    const emu_cpu_ops_t *const ops = emu_frontend_default();

    console_puts("\n\nrv32cortex-m: ");
    console_puts(ops->desc);
    console_puts(" on Cortex-M4 @ ");
    console_putu(SystemCoreClock / 1000000u);
    console_puts(" MHz\n");

    emu_board_img_size = emu_guest_image_size;
    emu_board_img_ro   = emu_guest_ro_size;
    emu_board_ram      = GUEST_RAM_BASE_PTR;
    emu_board_ram_size = GUEST_RAM_SIZE;

    if (!emu_build_address_space(&g_bus, &g_uart)) {
        console_puts("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    if (!emu_core_open(&g_core, ops, &g_bus, 0u)) {
        console_puts("fatal: frontend has no core 0\n");
        fatal_halt();
    }
    /*
     * The frontend's own devices: the shared ones and this core's. The
     * firmware is single-core -- 64 KiB of local RAM per G4MH PE does not
     * fit in 128 KiB of SRAM -- so there is one bus and one of each.
     */
    if ((ops->add_shared_devices != NULL &&
         !ops->add_shared_devices(&g_bus)) ||
        (ops->add_core_devices != NULL &&
         !ops->add_core_devices(g_core.cpu, &g_bus, 0u))) {
        console_puts("fatal: could not map the guest platform devices\n");
        fatal_halt();
    }

    ops->set_unmask_hook(g_core.cpu, emu_board_irq_unmask, NULL);
    emu_board_irqs_init();
    emu_uart_init(&g_uart, emu_console_uart_tx, guest_uart_rx, NULL);
    ops->set_syscall(g_core.cpu, emu_guest_syscall, &g_sc_ctx);
    ops->set_cache(g_core.cpu, &emu_arm_cache_ops);

    /*
     * The image is linked to run from guest RAM, so copy it out of flash.
     * Guests linked for the ROM window can skip this and reset straight to
     * EMU_GUEST_ROM_BASE.
     */
    /*
     * Only the writable tail. The read-only half is already reachable
     * as a bus region pointing into flash, and copying it would put it
     * in RAM twice -- which is the whole cost this removes.
     */
    if (emu_guest_image_size - emu_guest_ro_size > GUEST_RAM_SIZE) {
        console_puts("fatal: guest image larger than guest RAM\n");
        fatal_halt();
    }
    /*
     * **Zeroed, not installed.** The guest copies its own .data now --
     * start.S does it from __data_lma, in the read-only image window --
     * so all this owes is memory in a known state. This still memcpy'd
     * the writable half in after the F746 stopped, which was harmless
     * (the guest overwrote it with the same bytes) and exactly the kind
     * of divergence a shared runner is meant to make impossible.
     *
     * Zeroing the whole of it matters for a different reason: without
     * it one test's leftovers become the next test's initial state, and
     * a suite's results start depending on the order it ran in.
     */
    memset(GUEST_RAM_BASE_PTR, 0, GUEST_RAM_SIZE);

    emu_core_reset(&g_core, EMU_GUEST_RESET_PC);
    emu_core_boot(&g_core, EMU_GUEST_RAM_BASE, GUEST_RAM_SIZE);

    emu_cpu_status_t st;
    emu_core_status(&g_core, &st);

    console_puts("guest  ");
    console_putu(emu_guest_image_size);
    console_puts(" bytes at ");
    console_puthex(EMU_GUEST_RESET_PC);
    console_puts("\nram    ");
    console_putu(GUEST_RAM_SIZE / 1024u);
    console_puts(" KiB (");
    console_putu(GUEST_RAM_SIZE);
    console_puts(" bytes)\nbackend ");
    console_puts(st.backend);
    console_puts("\n");

